'use client';
import Breadcrumb from'@/components/atoms/Breadcrumb';
import Title from'@/components/atoms/Title';
import FeatureList from'@/components/molecules/FeatureList';

export default function page() {
    const breadcrumbRoutes = [{ label: 'الرئيسية', href: '/' }, { label: 'الشحن و التوصيل' }];

    
    return (
        <div className='bg-[#f8fafb]  '>
            <Breadcrumb cn=' !mt-0  !pt-[30px] container' routes={breadcrumbRoutes} />

            <div className=' container max-md:mt-[50px]  '>
                <div className=' border border-[var(--border-bg)] rounded-lg min-h-fit flex justify-center flex-col  bg-white p-[30px]  h-full text-[#878FA7] max-md:text-base  text-lg space-y-4'>
                    <Title title1='ما هي المعلومات الشخصية ' title2='التي نجمعها؟' cn='!mb-0' />

                    <p>عند الطلب أو التسجيل على موقعنا ، حسب الاقتضاء ، قد يُطلب منك إدخال اسمك أو عنوان بريدك الإلكتروني أو عنوانك البريدي أو معلومات بطاقة الائتمان أو تفاصيل أخرى لمساعدتك في تجربتك.</p>
                    <Title title1='متى نجمع ' title2='المعلومات؟' cn='!mb-0' />

                    <p>نقوم بجمع معلومات منك عندما تقوم بالتسجيل على موقعنا ، أو تقديم طلب ، أو الاشتراك في رسالة إخبارية ، أو ملء نموذج أو إدخال معلومات على موقعنا.</p>
                    <Title title1='كيف نستعمل ' title2='معلوماتك؟' cn='!mb-0' />

                    <p>قد نستخدم هذه المعلومات بالطرق التالية:</p>
                    <p>لتخصيص تجربة المستخدم والسماح لنا بتقديم نوع المحتوى وعروض المنتجات التي تهتم بها أكثر.</p>
                    <p>لتحسين موقعنا من أجل خدمتك بشكل أفضل.</p>
                    <p>للسماح لنا بتقديم خدمة أفضل لك في الاستجابة لطلبات خدمة العملاء الخاصة بك.</p>
                    <p>لإدارة مسابقة أو ترويج أو استطلاع أو ميزة أخرى في الموقع.</p>
                    <p>لمعالجة معاملاتك بسرعة.</p>
                    <p>لإرسال رسائل بريد إلكتروني دورية بخصوص طلبك أو المنتجات والخدمات الأخرى.</p>
                    <Title title1='كيف نقوم بحماية معلومات ' title2='الزائر؟' cn='!mb-0' />

                    <p>يتم احتواء معلوماتك الشخصية خلف شبكات مؤمنة ولا يمكن الوصول إليها إلا من قبل عدد محدود من الأشخاص الذين لديهم حقوق وصول خاصة إلى هذه الأنظمة ، وهم مطالبون بالحفاظ على سرية المعلومات. بالإضافة إلى ذلك ، يتم تشفير جميع المعلومات الحساسة / الائتمانية التي تقدمها عبر تقنية طبقة مآخذ التوصيل الآمنة (SSL).</p>
                    <p>نقوم بتنفيذ مجموعة متنوعة من الإجراءات الأمنية عندما يقوم المستخدم بإدخال أو إرسال أو الوصول إلى معلوماته للحفاظ على سلامة معلوماتك الشخصية.</p>
                    <p>تتم معالجة جميع المعاملات من خلال مزود البوابة ولا يتم تخزينها أو معالجتها على خوادمنا.</p>
                    <Title title1='هل نستخدم ملفات ' title2='تعريف الارتباط؟' cn='!mb-0' />

                    <p>نعم. ملفات تعريف الارتباط هي ملفات صغيرة ينقلها الموقع أو مزود الخدمة إلى محرك الأقراص الثابتة بجهاز الكمبيوتر الخاص بك من خلال متصفح الويب الخاص بك (إذا سمحت بذلك) والتي تمكن أنظمة الموقع أو مزود الخدمة من التعرف على متصفحك والتقاط وتذكر معلومات معينة. على سبيل المثال ، نستخدم ملفات تعريف الارتباط لمساعدتنا في تذكر العناصر الموجودة في عربة التسوق الخاصة بك ومعالجتها. يتم استخدامها أيضًا لمساعدتنا في فهم تفضيلاتك بناءً على نشاط الموقع السابق أو الحالي ، والذي يمكننا من تزويدك بخدمات محسّنة. نستخدم أيضًا ملفات تعريف الارتباط لمساعدتنا في تجميع البيانات المجمعة حول حركة مرور الموقع والتفاعل مع الموقع حتى نتمكن من تقديم تجارب وأدوات أفضل للموقع في المستقبل.</p>
                    <p>نحن نستخدم ملفات تعريف الارتباط من أجل:</p>
                    <p>تساعد في تذكر العناصر الموجودة في عربة التسوق ومعالجتها.</p>
                    <p>فهم وحفظ تفضيلات المستخدم للزيارات المستقبلية.</p>
                    <p>تقوم بتجميع البيانات المجمعة حول حركة مرور الموقع وتفاعلات الموقع من أجل تقديم تجارب وأدوات موقع أفضل في المستقبل. </p>
                    <p>يجوز لنا أيضًا استخدام خدمات جهات خارجية موثوقة تتعقب هذه المعلومات نيابة عنا.</p>
                    <p>يمكنك اختيار أن يقوم جهاز الكمبيوتر الخاص بك بتحذيرك في كل مرة يتم فيها إرسال ملف تعريف ارتباط ، أو يمكنك اختيار إيقاف تشغيل جميع ملفات تعريف الارتباط. يمكنك القيام بذلك من خلال إعدادات المستعرض الخاص بك (مثل انترنت اكسبلور). يختلف كل متصفح قليلاً ، لذا انظر إلى قائمة المساعدة في متصفحك لمعرفة الطريقة الصحيحة لتعديل ملفات تعريف الارتباط.</p>
                    <p>إذا قمت بتعطيل ملفات تعريف الارتباط ، فسيتم تعطيل بعض الميزات وسيؤدي ذلك إلى إيقاف تشغيل بعض الميزات التي تجعل تجربة موقعك أكثر كفاءة ولن تعمل بعض خدماتنا بشكل صحيح.</p>
                    <Title title1='إفصاحات الطرف الثالث  ' title2='و روابطها' cn='!mb-0' />

                    <p>نحن لا نبيع أو نتاجر أو ننقل معلومات التعريف الشخصية الخاصة بك إلى أطراف خارجية ما لم نقدم لك إشعارًا مسبقًا. لا يشمل ذلك شركاء استضافة مواقع الويب والأطراف الأخرى التي تساعدنا في تشغيل موقعنا الإلكتروني أو إدارة أعمالنا أو خدمتك ، طالما أن هذه الأطراف توافق على الحفاظ على سرية هذه المعلومات. يجوز لنا أيضًا الإفصاح عن معلوماتك عندما نعتقد أن الإفراج عنها مناسب للامتثال للقانون أو فرض سياسات موقعنا أو حماية حقوقنا أو حقوق الآخرين أو ممتلكاتهم أو سلامتنا.</p>
                    <p>ومع ذلك ، قد يتم تقديم معلومات الزائر غير الشخصية إلى أطراف أخرى للتسويق أو الإعلان أو استخدامات أخرى.</p>
                    <p>روابط الطرف الثالث:</p>
                    <p>في بعض الأحيان ، وفقًا لتقديرنا ، قد نقوم بتضمين أو عرض منتجات أو خدمات جهات خارجية على موقعنا. مواقع الطرف الثالث هذه لها سياسات خصوصية منفصلة ومستقلة. لذلك لا نتحمل أي مسؤولية أو التزام تجاه محتوى وأنشطة هذه المواقع المرتبطة. ومع ذلك ، فإننا نسعى لحماية سلامة موقعنا ونرحب بأي ملاحظات حول هذه المواقع.</p>
                    <Title title1='مقدمي ' title2='الخدمة' cn='!mb-0' />

                    <p>نحن نوظف شركات وأفرادًا من أطراف ثالثة لتسهيل موقعنا على الويب (“مزودي الخدمة”) ، أو لتوفير موقعنا الإلكتروني نيابة عنا ، أو لأداء الخدمات المتعلقة بالموقع الإلكتروني أو لمساعدتنا في تحليل كيفية استخدام موقعنا. هذه الأطراف الثالثة لديها حق الوصول إلى معلوماتك الشخصية فقط لأداء هذه المهام نيابة عنا وهي ملزمة بعدم الكشف عنها أو استخدامها لأي غرض آخر.</p>
                    <Title title1='معالجات ' title2='المدفوعات' cn='!mb-0' />

                    <p>نحن نقدم منتجات و / أو خدمات مدفوعة على موقعنا الإلكتروني. في هذه الحالة ، نستخدم خدمات الجهات الخارجية لمعالجة الدفع (مثل معالجي الدفع).</p>
                    <p>لن نقوم بتخزين أو جمع تفاصيل بطاقة الدفع الخاصة بك. يتم تقديم هذه المعلومات مباشرة إلى معالجي الدفع التابعين لجهات خارجية والذين يخضع استخدامهم لمعلوماتك الشخصية لسياسة الخصوصية الخاصة بهم. تلتزم معالجات الدفع هذه بالمعايير التي وضعها PCI-DSS كما يديرها مجلس معايير أمان PCI.</p>
                    <Title title1='الأحكام ' title2='والشروط' cn='!mb-0' />

                    <p>يرجى أيضًا زيارة قسم الشروط والأحكام الخاص بنا الذي يحدد الاستخدام وإخلاء المسؤولية وحدود المسؤولية التي تحكم استخدام موقعنا على الإنترنت في الشروط والأحكام.</p>
                    <Title title1='الاتصال ' title2='بنا' cn='!mb-0' />

                    <p>إذا كانت هناك أي أسئلة بخصوص سياسة الخصوصية هذه ، يمكنك الاتصال بنا من خلال هذا النموذج.</p>
                    <p>إذا قررنا تغيير سياسة الخصوصية الخاصة بنا ، فسننشر هذه التغييرات على هذه الصفحة.</p>
                </div>
            </div>

            <FeatureList />
        </div>
    );
}
