'use client';

import Breadcrumb from '@/components/atoms/Breadcrumb';
import Title from '@/components/atoms/Title';
import FeatureList from '@/components/molecules/FeatureList';

export default function Page() {
    const breadcrumbRoutes = [
        { label: 'الرئيسية', href: '/' },
        { label: 'شروط الخدمة' },
    ];

    return (
        <div className="bg-[#f8fafb]">
            <Breadcrumb cn="!mt-0 !pt-[30px] container" routes={breadcrumbRoutes} />

            <div className="container max-md:mt-[50px]">
                <div className="border border-[var(--border-bg)] rounded-lg min-h-fit flex justify-center flex-col bg-white p-[30px] h-full text-[#878FA7] max-md:text-base text-lg space-y-4">
                    <Title title1="شروط" title2="الخدمة" cn="!mb-0" />

                    <p>
                        يتم تشغيل هذا الموقع من قبل دكاني. في جميع أنحاء الموقع، تشير
                        المصطلحات "نحن" و "خاصتنا" إلى متجرنا. يقدم متجرنا هذا الموقع،
                        بما في ذلك جميع المعلومات والأدوات والخدمات المتاحة لك، كمستخدم،
                        من هذا الموقع، بشرط موافقتك على جميع الشروط والأحكام والسياسات
                        والإشعارات الواردة هنا.
                    </p>

                    <p>
                        من خلال زيارة موقعنا و/أو شراء شيء منا، فإنك تشارك في "الخدمة"
                        الخاصة بنا وتوافق على الالتزام بالشروط والأحكام التالية ("شروط
                        الخدمة" ، "الشروط")، بما في ذلك تلك الشروط والأحكام والسياسات
                        الإضافية المشار إليها هنا و/أو المتاحة من خلال ارتباط تشعبي.
                        تنطبق شروط الخدمة هذه على جميع مستخدمي الموقع، بما في ذلك على سبيل
                        المثال لا الحصر المستخدمين من المتصفحات و/أو البائعين و/أو العملاء
                        و/أو التجار و/أو المساهمين في المحتوى.
                    </p>

                    <p>
                        يرجى قراءة شروط الخدمة هذه بعناية قبل الوصول إلى موقعنا الإلكتروني
                        أو استخدامه. من خلال الوصول إلى أو استخدام أي جزء من الموقع، فإنك
                        توافق على الالتزام بشروط الخدمة هذه. إذا كنت لا توافق على جميع
                        شروط وأحكام هذه الاتفاقية، فلا يجوز لك الوصول إلى موقع الويب أو
                        استخدام أي خدمات. إذا كانت شروط الخدمة هذه بمثابة عرض، فإن القبول
                        يقتصر صراحةً على شروط الخدمة هذه.
                    </p>

                    <p>
                        تخضع أيضًا أي ميزات أو أدوات جديدة تضاف إلى المتجر الحالي لشروط
                        الخدمة. يمكنك مراجعة أحدث إصدار من شروط الخدمة في أي وقت على هذه
                        الصفحة. نحتفظ بالحق في تحديث أو تغيير أو استبدال أي جزء من شروط
                        الخدمة هذه عن طريق نشر التحديثات و/أو التغييرات على موقعنا. تقع على
                        عاتقك مسؤولية مراجعة هذه الصفحة بشكل دوري لمعرفة التغييرات.
                        استمرار استخدامك أو الوصول إلى موقع الويب بعد نشر أي تغييرات يشكل
                        قبولًا لهذه التغييرات.
                    </p>

                    <p>
                        متجرنا مستضاف على خوادم منصة وشق washak.net وهم يزودوننا بمنصة
                        التجارة الإلكترونية عبر الإنترنت التي تسمح لنا ببيع منتجاتنا
                        وخدماتنا لك.
                    </p>

                    <Title title1="القسم 1 – شروط المتجر" title2="عبر الإنترنت" cn="!mb-0" />
                    <p>
                        بالموافقة على شروط الخدمة هذه، فإنك تقر بأنك على الأقل تبلغ سن
                        الرشد في ولايتك أو إقليم إقامتك، أو أنك تبلغ سن الرشد في ولايتك أو
                        إقليم إقامتك وأنك منحتنا موافقتك على السماح لأي من المعالين القصر
                        باستخدام هذا الموقع. لا يجوز لك استخدام منتجاتنا لأي غرض غير قانوني
                        أو غير مصرح به ولا يجوز لك، في استخدام الخدمة، انتهاك أي قوانين في
                        ولايتك القضائية (بما في ذلك على سبيل المثال لا الحصر قوانين حقوق
                        النشر). يجب ألا تنقل أي فيروسات متنقلة أو فيروسات أو أي رمز ذي
                        طبيعة مدمرة. سيؤدي خرق أو انتهاك أي من الشروط إلى الإنهاء الفوري
                        لخدماتك.
                    </p>

                    <Title title1="القسم 2 – الشروط" title2="العامة" cn="!mb-0" />
                    <p>
                        بالموافقة على شروط الخدمة هذه، فإنك تقر بأنك على الأقل تبلغ سن
                        الرشد في ولايتك أو إقليم إقامتك، أو أنك تبلغ سن الرشد في ولايتك أو
                        إقليم إقامتك وأنك منحتنا موافقتك على السماح لأي من المعالين القصر
                        باستخدام هذا الموقع. لا يجوز لك استخدام منتجاتنا لأي غرض غير قانوني
                        أو غير مصرح به ولا يجوز لك، في استخدام الخدمة، انتهاك أي قوانين في
                        ولايتك القضائية (بما في ذلك على سبيل المثال لا الحصر قوانين حقوق
                        النشر). يجب ألا تنقل أي فيروسات متنقلة أو فيروسات أو أي رمز ذي
                        طبيعة مدمرة. سيؤدي خرق أو انتهاك أي من الشروط إلى الإنهاء الفوري
                        لخدماتك.
                    </p>

                    <Title title1="القسم 3 – دقة المعلومات" title2="واكتمالها وحداثتها" cn="!mb-0" />
                    <p>
                        نحن لسنا مسؤولين إذا كانت المعلومات المتوفرة على هذا الموقع غير
                        دقيقة أو كاملة أو حديثة. يتم توفير المواد الموجودة على هذا الموقع
                        للحصول على معلومات عامة فقط ولا ينبغي الاعتماد عليها أو استخدامها
                        كأساس وحيد لاتخاذ القرارات دون استشارة مصادر المعلومات الأولية أو
                        الأكثر دقة أو الأكثر اكتمالًا أو في الوقت المناسب. أي اعتماد على
                        المواد الموجودة على هذا الموقع هو على مسؤوليتك الخاصة. قد يحتوي هذا
                        الموقع على معلومات تاريخية معينة. المعلومات التاريخية، بالضرورة،
                        ليست حديثة ويتم توفيرها للرجوع إليها فقط. نحتفظ بالحق في تعديل
                        محتويات هذا الموقع في أي وقت، لكننا لسنا ملزمين بتحديث أي معلومات
                        على موقعنا. أنت توافق على أنه من مسؤوليتك مراقبة التغييرات على
                        موقعنا.
                    </p>

                    <Title title1="القسم 4 – تعديلات على" title2="الخدمة والأسعار" cn="!mb-0" />
                    <p>
                        أسعار منتجاتنا عرضة للتغيير دون إشعار. نحن نحتفظ بالحق في أي وقت في
                        تعديل أو إيقاف الخدمة (أو أي جزء أو محتوى منها) دون إشعار في أي وقت.
                        لن نكون مسؤولين تجاهك أو تجاه أي طرف ثالث عن أي تعديل أو تغيير في
                        الأسعار أو تعليق أو وقف للخدمة.
                    </p>

                    <Title title1="القسم 5 – المنتجات أو" title2="الخدمات (إن وجدت)" cn="!mb-0" />
                    <p>
                        قد تتوفر بعض المنتجات أو الخدمات حصريًا عبر الإنترنت من خلال موقع
                        الويب. قد يكون لهذه المنتجات أو الخدمات كميات محدودة وتخضع للإرجاع
                        أو الاستبدال فقط وفقًا لسياسة الإرجاع الخاصة بنا. لقد بذلنا قصارى
                        جهدنا لعرض ألوان وصور منتجاتنا التي تظهر في الموقع بأكبر قدر ممكن
                        من الدقة.
                    </p>
                </div>
            </div>

            <FeatureList />
        </div>
    );
}