'use client';
import Breadcrumb from '@/components/atoms/Breadcrumb';
import FeatureList from '@/components/molecules/FeatureList';

export default function page() {

    const breadcrumbRoutes = [{ label: 'الرئيسية', href: '/' }, { label: 'الاستبدال و الاسترجاع' }];

    return (
        <div className='bg-[#f8fafb]  '>
            <Breadcrumb cn=' !mt-0  !pt-[30px] container' routes={breadcrumbRoutes} />

            <div className=" container max-md:mt-[50px]  ">
                <div className=" border border-[var(--border-bg)] rounded-lg min-h-fit flex justify-center flex-col  bg-white p-[30px]  h-full text-[#878FA7] max-md:text-base  text-lg space-y-4">
                    <p>نشكر اختياركم الكتروني لشراء منتجاتكم الرهيبة المفضلة ويسعدنا أن نقوم بخدمتكم.  في بعض الأحيان ربما يتغير رأيك فيما يتعلق بالمنتجات التي قمت بشرائها، لا عليك. فنحن سنبذل ما في وسعنا لتتم عملية الاسترجاع أو الاستبدال بمنتهى البساطة والسلاسة بقدر الإمكان.</p>
                    <p>لقد قمنا بتسهيل عملية الاسترجاع أو الاستبدال من خلال الإجراءات التالية:</p>
                    <p>  سياسة الفترة الزمنية لاسترجاع أو استبدال المشتريات:</p>
                    <p>1. عند الرغبة في استبدال أو استرجاع المنتج عليك الاتصال بنا أولا.</p>
                    <p>2. يحق للعميل استرجاع المنتج خلال 3 أيام من تاريخ الاستلام، بشرط أن يكون المنتج سليما لم يطرأ إليه أي تغيير، ويتحمل العميل تكاليف الشحن كاملا، ويتم إرجاع تكلفة المنتج للعميل خلال 14 يوم عمل.</p>
                    <p>3. يحق للعميل استبدال المنتج بمنتج آخر، وذلك قبل إرسال الشحنة. وبعد إرسال الشحنة يحق له الاستبدال خلال 14 أيام عمل، وعليه تحمل تكلفة الشحن كاملا وفرق تكلفة المنتج إن وجد.</p>
                    <p>4. إذا كان المنتج معيبا، أو غير مطابق للمواصفات التي تم تحديدها وقت الشراء يحق للعميل استبدال المنتج أو استرجاعه خلال 14 يوما، وعلى العميل في هذه الحالة إرسال ما يثبت تكاليف الشحن موضح فيه: رقم الارسالية – الشحن – والتكلفة. فيحق للعميل عندئذ استرجاع المبلغ كاملا.</p>
                    <p>5. المنتجات الشاملة في الخصومات والعروض لا تستبدل ولا تسترجع، ويستثنى من ذلك وجود عيب في المنتج، انظر: المادة 4 من سياسات الاسترجاع والاستبدال.</p>
                    <p>6. لا يقبل استرجاع المنتجات أو استبدالها في الحالات التالية:</p>
                    <p className='!mr-[20px] !mt-[0px] ' >- لا يقبل الاسترجاع بعد مضي 3 أيام من تاريخ الاستلام، ولا يقبل الاستبدال بعد 14 يوما.</p>
                    <p className='!mr-[20px] !mt-[0px] ' >- عند تغير المنتج عن حالته الأصلية لأي سبب من الاسباب</p>
                    <p className='!mr-[20px] !mt-[0px] ' >- عند الاستعمال بما يتعدى غرض التجربة.</p>
                    <p className='!mr-[20px] !mt-[0px] ' >- المنتجات التي تم تصنيعها بطلب من العميل وفقا لمواصفات حددها.</p>

                </div>
            </div>

            <FeatureList />
        </div>
    );
}
